# 모집단 : 연구나 관심의 대상이 되는 전체 집단
# 표본집단 : 모집단에서 선택된 일부 집단

# 표본 오차?
# 예) A학교에 학생이 1000명 있다고 가정. 이 학교에서 평균 키를 알고 싶다면
# 모든 학생(모집단)의 키를 조사하는 것이 가장 정확합니다.
# 하지만 시간이 부족해서 100명만 랜덤하게(표본집단) 조사했다고 가정.
# 이 100명의 평균 키가 전체 학생의 평균 키와 다를 가능성이 있어요. 
# 이 차이를 바로 '표본오차'라고 합니다.

# 특정 포장 식품의 무게
# 포장 겉면의 내용물 중량이 300g이라고 표시가 되어있었음.
# 10개의 제품(표본집단)을 구입하여 조사한 결과 아래와 같은 결과가 나왔음.

weights = c(310, 295, 298, 302, 305, 285, 300, 311, 301, 294) # 표본집단데이터

# 1. 표본 평균 계산

weights_mean = mean(weights)

print(weights_mean)

# 2. 표본 표준편차계산

weights_sd = sd(weights)
print(weights_sd)

weights_count = length(weights)
print(weights_count)

표본오차 = weights_sd /sqrt(weights_count)
cat('표본 평균(g) : ', weights_mean, '\n')
cat('표본 오차(g) : ', round(표본오차,2),'\n')

# 표준오차
# 표준오차는 여러 번 표본을 뽑아서 평균을 구하면, 그 평균값들이 얼마나 퍼져 있는지를
# 나타냅니다.

# 예) 사과 상자에 총 100개의 사(모집단)과가 있습니다.
# 그 중 80개는 맛있는 사과고, 20개는 맛없는 사과입니다. 
# 상자에서 10개만(표본집단) 뽑아서 맛있는 사과의 비율을 추정하려고 합니다.
# 10개를 뽑았을 때 맛있는 사과의 비율이 항상 80% 일까요?
# 어떤 경우는 7개가 맛있는 사과고, 어떤 경우에는 9개가 맛있을 수도 있습니다.
# 표준오차는 우리가 뽑은 표본집단에서 계산한 비율이 실제 모집단 비율(80%)과 얼마나 
# 차이가 있는지를 나타냅니다.

N = 100 # 100개 사과 모집단 크기
n = 10 # 10개 뽑은 사과
p = 0.8 # 모집단에서 맛있는 사과 비율~ (80%)

# 표준오차 계산
se = sqrt((p*(1-p)) / n)
cat('표준오차 : ', round(se,2), '\n')
# 표준오차가 0.13이라는 것은
# 실제 모집단 비율(80%)에서 약 13% 범위 내에서 변동할 가능성이 있다는 뜻
# 표본비율이 대략 67% ~ 93% 사이에 있을 가능성이 높습니다.

# 초기하 분포(뽑은 데이터를 다시 넣을 수 없음)
# 예)
# 어느 휴대폰충전기 제조공장에서 출하된 제품의 품질을 조사한 결과 
# 40개 중 5개가 불량품임.
# 10개를 구입했을 때 불량품이 없을 확률을 구해보자.

전체제품수 = 40
불량품수 = 5
구입한휴대폰수 = 10
최종불량품 = 0 #불량품 없을 확률

결과 = dhyper(최종불량품, 불량품수, 전체제품수 - 불량품수, 구입한휴대폰수)
cat('구입한 휴대폰에서 불량품이 없을 확률:', 결과, '\n') #0.21 -> 21%












